practice-for-ch-rails-first-routes-long-practice-main/first_routes/app/controllers/users_controller.rb

  def create
    user = User.new(params_permit)
    if user.save
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Jordy"], ["email", "Jor@dy.com"], ["created_at", "2023-06-07 21:37:00.511702"], ["updated_at", "2023-06-07 21:37:00.511702"]]